podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SCT_LPC82x.svd.xml
            <register>
               <name>INPUT</name>
               <description>SCT input register</description>
               <addressOffset>0x48</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>AIN0</name>
                     <description>. Input 0 state.Direct read</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIN1</name>
                     <description>Input 1 state. Direct read</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIN2</name>
                     <description>Input 2 state. Direct read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIN3</name>
                     <description>Input 3 state. Direct read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIN0</name>
                     <description>Input 0 state</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIN1</name>
                     <description>Input 1 state</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIN2</name>
                     <description>Input 2 state</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIN3</name>
                     <description>Input 3 state</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REGMODE</name>
               <description>SCT match/capture registers mode register</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>REGMOD_L</name>
                     <description>Each bit controls one pair of match/capture registers (register pair 0 = bit 0, register pair 1 = bit 1,..., register pair 7 = bit 7).  0 = registers operate as match registers. 1 = registers operate as capture</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REGMOD_H</name>
                     <description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 7 = bit 23). 0 = registers operate as match registers. 1 = registers operate as capture</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUTPUT</name>
               <description>SCT output register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>OUT</name>
                     <description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 5 = bit 5)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUTPUTDIRCTRL</name>
               <description>SCT output counter direction control register</description>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>SETCLR0</name>
                     <description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INDEPENDENT</name>
                           <description>Set and clear do not depend on any counter</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REVERSED</name>
                           <description>Set and clear are reversed when counter L or the unified counter is counting down</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REVERSED_H</name>
                           <description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="SETCLR0" > <name>SETCLR1</name> <description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="SETCLR0" > <name>SETCLR2</name> <description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="SETCLR0" > <name>SETCLR3</name> <description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="SETCLR0" > <name>SETCLR4</name> <description>Set/clear operation on output 4. Value 0x3 is reserved. Do not program this value</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="SETCLR0" > <name>SETCLR5</name> <description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value</description> <bitOffset>10</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>RES</name>
               <description>SCT conflict resolution register</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>O0RES</name>
                     <description>Effect of simultaneous set and clear on output 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_OUTPUT_OR_CLEAR</name>
                           <description>Set output (or clear based on the SETCLR0 field)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_OUTPUT_OR_SET</name>
                           <description>Clear output (or set based on the SETCLR0 field)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLE_OUTPUT</name>
                           <description>Toggle output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>O1RES</name>
                     <description>Effect of simultaneous set and clear on output 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_OUTPUT_OR_CLEAR</name>
                           <description>Set output (or clear based on the SETCLR1 field)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_OUTPUT_OR_SET</name>
                           <description>Clear output (or set based on the SETCLR1 field)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLE_OUTPUT</name>
                           <description>Toggle output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>O2RES</name>
                     <description>Effect of simultaneous set and clear on output 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_OUTPUT_OR_CLEAR</name>
                           <description>Set output (or clear based on the SETCLR2 field)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_OUTPUT_N_OR_S</name>
                           <description>Clear output n (or set based on the SETCLR2 field)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLE_OUTPUT</name>
                           <description>Toggle output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>O3RES</name>
                     <description>Effect of simultaneous set and clear on output 3</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_OUTPUT_OR_CLEAR</name>
                           <description>Set output (or clear based on the SETCLR3 field)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_OUTPUT_OR_SET</name>
                           <description>Clear output (or set based on the SETCLR3 field)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLE_OUTPUT</name>
                           <description>Toggle output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>O4RES</name>
                     <description>Effect of simultaneous set and clear on output 4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_OUTPUT_OR_CLEAR</name>
                           <description>Set output (or clear based on the SETCLR4 field)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_OUTPUT_OR_SET</name>
                           <description>Clear output (or set based on the SETCLR4 field)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLE_OUTPUT</name>
                           <description>Toggle output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>O5RES</name>
                     <description>Effect of simultaneous set and clear on output 5</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET_OUTPUT_OR_CLEAR</name>
                           <description>Set output (or clear based on the SETCLR5 field)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_OUTPUT_OR_SET</name>
                           <description>Clear output (or set based on the SETCLR5 field)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOGGLE_OUTPUT</name>
                           <description>Toggle output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>DMAREQ%s</name>
               <description>SCT DMA request %s register</description>
               <addressOffset>0x5C</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DEV_0</name>
                     <description>If bit n is one, event n sets DMA request 0 (event 0 = bit 0, event 1 = bit 1,..., event 5 = bit 5)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DRL0</name>
                     <description>A 1 in this bit makes the SCT set DMA request 0 when it loads the  Match_L/Unified registers from the Reload_L/Unified</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQ0</name>
                     <description>This read-only bit indicates the state of DMA Request 0</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVEN</name>
               <description>SCT event enable register</description>
               <addressOffset>0xF0</addressOffset>
               <fields>
                  <field>
                     <name>IEN</name>
                     <description>The SCT requests an interrupt when bit n of this register and the event flag register are both one (event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVFLAG</name>
               <description>SCT event flag register</description>
               <addressOffset>0xF4</addressOffset>
               <fields>
                  <field>
                     <name>FLAG</name>
                     <description>Bit n is one if event n has occurred since reset or a 1 was last written to this bit (event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONEN</name>
               <description>SCT conflict enable register</description>
               <addressOffset>0xF8</addressOffset>
               <fields>
                  <field>
                     <name>NCEN</name>
                     <description>The SCT requests interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1,..., output 5 = bit 5)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFLAG</name>
               <description>SCT conflict flag register</description>
               <addressOffset>0xFC</addressOffset>
               <fields>
                  <field>
                     <name>NCFLAG</name>
                     <description>Bit n is one if a no-change conflict event occurred on output n since  reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1,..., output 5 = bit 5)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BUSERRL</name>
                     <description>The most recent bus error from this SCT involved writing CTR  L/Unified, STATE L/Unified, MATCH L/Unified, or the Output register when the  L/U counter was not halted. A word write to certain L  and H registers can be half successful and half unsuccessful</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSERRH</name>
                     <description>The most recent bus error from this SCT involved writing CTR H,  STATE H, MATCH H, or the Output register when the H  counter was not halted</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP0</name>
               <description>SCT capture register of capture channel 0 to 7; REGMOD0 to REGMODE7 = 1</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>CAPn_L</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CAPn_H</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATCH0</name>
               <description>SCT match value register of match channels 0 to 7; REGMOD0 to REGMODE7 = 0</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>MATCHn_L</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be  compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MATCHn_H</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be  compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
