podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SCT_LPC82x.svd.xml
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,2,3,4,5,6</dimIndex>
               <name>MATCH%s</name>
               <description>SCT match value register of match channels 0 to 7; REGMOD0 to REGMODE7 = 0</description>
               <addressOffset>0x104</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>MATCHn_L</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be  compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MATCHn_H</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be  compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP1</name>
               <description>SCT capture register of capture channel 0 to 7; REGMOD0 to REGMODE7 = 1</description>
               <addressOffset>0x104</addressOffset>
               <fields>
                  <field>
                     <name>CAPn_L</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CAPn_H</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>2,3,4,5,6</dimIndex>
               <name>CAP%s</name>
               <description>SCT capture register of capture channel 0 to 7; REGMOD0 to REGMODE7 = 1</description>
               <addressOffset>0x108</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CAPn_L</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CAPn_H</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP7</name>
               <description>SCT capture register of capture channel 0 to 7; REGMOD0 to REGMODE7 = 1</description>
               <addressOffset>0x11C</addressOffset>
               <fields>
                  <field>
                     <name>CAPn_L</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CAPn_H</name>
                     <description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATCH7</name>
               <description>SCT match value register of match channels 0 to 7; REGMOD0 to REGMODE7 = 0</description>
               <addressOffset>0x11C</addressOffset>
               <fields>
                  <field>
                     <name>MATCHn_L</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be  compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MATCHn_H</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be  compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAPCTRL0</name>
               <description>SCT capture control register 0 to 7; REGMOD0 = 1 to REGMODE7 = 1</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>CAPCONn_L</name>
                     <description>If bit m is one, event m causes the CAPn_L (UNIFY = 0) or the CAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CAPCONn_H</name>
                     <description>If bit m is one, event m causes the CAPn_H (UNIFY = 0) register to be loaded (event 0 = bit 16, event 1 = bit 17,..., event 7 = bit 23)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATCHREL0</name>
               <description>SCT match reload value register 0 to 7; REGMOD0 = 0 to REGMODE7 = 0</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>RELOADn_L</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be loaded into the SCTMATCHn_L register. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be loaded into the MATCHn register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RELOADn_H</name>
                     <description>When UNIFY = 0, read or write the 16-bit to be loaded into the MATCHn_H register. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be loaded into the MATCHn register</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,2,3,4,5,6</dimIndex>
               <name>MATCHREL%s</name>
               <description>SCT match reload value register 0 to 7; REGMOD0 = 0 to REGMODE7 = 0</description>
               <addressOffset>0x204</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>RELOADn_L</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be loaded into the SCTMATCHn_L register. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be loaded into the MATCHn register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RELOADn_H</name>
                     <description>When UNIFY = 0, read or write the 16-bit to be loaded into the MATCHn_H register. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be loaded into the MATCHn register</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAPCTRL1</name>
               <description>SCT capture control register 0 to 7; REGMOD0 = 1 to REGMODE7 = 1</description>
               <addressOffset>0x204</addressOffset>
               <fields>
                  <field>
                     <name>CAPCONn_L</name>
                     <description>If bit m is one, event m causes the CAPn_L (UNIFY = 0) or the CAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CAPCONn_H</name>
                     <description>If bit m is one, event m causes the CAPn_H (UNIFY = 0) register to be loaded (event 0 = bit 16, event 1 = bit 17,..., event 7 = bit 23)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>2,3,4,5,6</dimIndex>
               <name>CAPCTRL%s</name>
               <description>SCT capture control register 0 to 7; REGMOD0 = 1 to REGMODE7 = 1</description>
               <addressOffset>0x208</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CAPCONn_L</name>
                     <description>If bit m is one, event m causes the CAPn_L (UNIFY = 0) or the CAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CAPCONn_H</name>
                     <description>If bit m is one, event m causes the CAPn_H (UNIFY = 0) register to be loaded (event 0 = bit 16, event 1 = bit 17,..., event 7 = bit 23)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAPCTRL7</name>
               <description>SCT capture control register 0 to 7; REGMOD0 = 1 to REGMODE7 = 1</description>
               <addressOffset>0x21C</addressOffset>
               <fields>
                  <field>
                     <name>CAPCONn_L</name>
                     <description>If bit m is one, event m causes the CAPn_L (UNIFY = 0) or the CAPn (UNIFY = 1) register to be loaded (event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CAPCONn_H</name>
                     <description>If bit m is one, event m causes the CAPn_H (UNIFY = 0) register to be loaded (event 0 = bit 16, event 1 = bit 17,..., event 7 = bit 23)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATCHREL7</name>
               <description>SCT match reload value register 0 to 7; REGMOD0 = 0 to REGMODE7 = 0</description>
               <addressOffset>0x21C</addressOffset>
               <fields>
                  <field>
                     <name>RELOADn_L</name>
                     <description>When UNIFY = 0, read or write the 16-bit value to be loaded into the SCTMATCHn_L register. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be loaded into the MATCHn register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RELOADn_H</name>
                     <description>When UNIFY = 0, read or write the 16-bit to be loaded into the MATCHn_H register. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be loaded into the MATCHn register</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EV0_STATE</name>
               <description>SCT event state register 0</description>
               <addressOffset>0x300</addressOffset>
               <fields>
                  <field>
                     <name>STATEMSKn</name>
                     <description>If bit m is one, event n (n= 0 to 7) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 7 = bit 7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
