podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SCT_LPC82x.svd.xml
            <register>
               <name>OUT3_SET</name>
               <description>SCT output 0 set register</description>
               <addressOffset>0x518</addressOffset>
               <fields>
                  <field>
                     <name>SET</name>
                     <description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUT3_CLR</name>
               <description>SCT output 0 clear register</description>
               <addressOffset>0x51C</addressOffset>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUT4_SET</name>
               <description>SCT output 0 set register</description>
               <addressOffset>0x520</addressOffset>
               <fields>
                  <field>
                     <name>SET</name>
                     <description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUT4_CLR</name>
               <description>SCT output 0 clear register</description>
               <addressOffset>0x524</addressOffset>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUT5_SET</name>
               <description>SCT output 0 set register</description>
               <addressOffset>0x528</addressOffset>
               <fields>
                  <field>
                     <name>SET</name>
                     <description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUT5_CLR</name>
               <description>SCT output 0 clear register</description>
               <addressOffset>0x52C</addressOffset>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 7 = bit 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
